/*********************************************************************************/
/* 周辺に関する定義                                                              */
/*                                         designed by hamayan since 2018/09/19  */
/*********************************************************************************/
#ifndef	_PERIPHERAL_H_
#define	_PERIPHERAL_H_

#include "stm32f4xx.h"

/*************************************************************************/
/* プロトタイプ宣言                                                      */
/*************************************************************************/
void GPIO_Terminal_Init( GPIO_TypeDef* GPIOx, int Mode, u16 Pins );

enum  GPIO_MODE_TYPE {OUT2M_PP,OUT25M_PP,OUT50M_PP,OUT100M_PP,OUT2M_OD,OUT25M_OD,OUT50M_OD,OUT100M_OD,
  IN_FLOAT,IN_UP,IN_DOWN,AF_PP,AF_OD,AN_IN,};

#endif	/* _PERIPHERAL_H_ */

/*********************************************************************************/
/* end of file                                                                   */
/*                                         designed by hamayan since 2018/09/19  */
/*********************************************************************************/
